roboard/86Duino/hardware/86duino/x86/libraries/FirmataPlus86/utility/ESP82664fp.cpp
/**
 * @file ESP82664fp4fp.cpp
 * @brief The implementation of class ESP82664fp. 
 * @author Wu Pengfei<pengfei.wu@itead.cc> 
 * @date 2015.02
 *
 * @Modified by CJ Wu<sayter@dmp.com.tw>
 * @date 2017.01
 * 
 * @par Copyright:
 * Copyright (c) 2015 ITEAD Intelligent Systems Co., Ltd. \n\n
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version. \n\n
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "utility/ESP82664fp.h"
#include "queue.h"

#define LOG_OUTPUT_DEBUG            (1)
#define LOG_OUTPUT_DEBUG_PREFIX     (1)

#define logDebug(arg)\
    do {\
        if (LOG_OUTPUT_DEBUG)\
        {\
            if (LOG_OUTPUT_DEBUG_PREFIX)\
            {\
                Serial.print("[LOG Debug: ");\
                Serial.print((const char*)__FILE__);\
                Serial.print(",");\
                Serial.print((unsigned int)__LINE__);\
                Serial.print(",");\
                Serial.print((const char*)__FUNCTION__);\
                Serial.print("] ");\
            }\
            Serial.print(arg);\
        }\
    } while(0)


ESP82664fp::ESP82664fp(void)
{
	nb_state_s = 0;
	nb_state_l = 0;
	nb_time_s = millis();
	nb_time_l = millis();
}

void ESP82664fp::init(HardwareSerial &uart, uint32_t baud)
{
	m_puart = &uart;
	m_puart->begin(baud);
    q = CreateQueue(4096);
    ClearQueue(q);
    for (int i=0; i<1024; i++) nbData[i] = '\0';
    clientConnected = false;
}

void ESP82664fp::init(HardwareSerial &uart, uint32_t baud, uint8_t pin)
{
	pinMode(pin, OUTPUT);
	digitalWrite(pin, HIGH);
	m_puart = &uart;
	m_puart->begin(baud);
    q = CreateQueue(4096);
    ClearQueue(q);
    for (int i=0; i<1024; i++) nbData[i] = '\0';
    clientConnected = false;
}

bool ESP82664fp::kick(void)
{
    return eAT();
}

bool ESP82664fp::restart(void)
{
    unsigned long start;
    if (eATRST()) {
        delay(2000);
        start = millis();
        while (millis() - start < 3000) {
            if (eAT()) {
                delay(1500); /* Waiting for stable */
                return true;
            }
            delay(100);
        }
    }
    return false;
}

bool ESP82664fp::getVersion(char* version, int size)
{
    return eATGMR(version, size);
}

bool ESP82664fp::setOprToStation(char* str_mode, int size)
{
    uint8_t mode;
    if (!qATCWMODE(&mode, str_mode, size)) {
        return false;
    }
    if (mode == 1) {
        return true;
    } else {
        if (sATCWMODE(1) && restart()) {
            return true;
        } else {
            return false;
        }
    }
}

bool ESP82664fp::setOprToSoftAP(char* str_mode, int size)
{
    uint8_t mode;
    if (!qATCWMODE(&mode, str_mode, size)) {
        return false;
    }
    if (mode == 2) {
        return true;
    } else {
        if (sATCWMODE(2) && restart()) {
            return true;
        } else {
            return false;
        }
    }
}

bool ESP82664fp::setOprToStationSoftAP(char* str_mode, int size)
{
    uint8_t mode;
    if (!qATCWMODE(&mode, str_mode, size)) {
        return false;
    }
    if (mode == 3) {
        return true;
    } else {
        if (sATCWMODE(3) && restart()) {
            return true;
        } else {
            return false;
        }
    }
}

bool ESP82664fp::getAPList(char* list, int size)
{
    return eATCWLAP(list, size);
}

bool ESP82664fp::joinAP(String ssid, String pwd)
{
    return sATCWJAP(ssid, pwd);
}

bool ESP82664fp::leaveAP(void)
{
    return eATCWQAP();
}

bool ESP82664fp::setSoftAPParam(String ssid, String pwd, uint8_t chl, uint8_t ecn)
{
    return sATCWSAP(ssid, pwd, chl, ecn);
}

bool ESP82664fp::getJoinedDeviceIP(char* list, int size)
{
    return eATCWLIF(list, size);
}

bool ESP82664fp::getIPStatus(char* list, int size)
{
    return eATCIPSTATUS(list, size);
}

bool ESP82664fp::getLocalIP(int* list, int size)
{
    return eATCIFSR(list, size);
}

bool ESP82664fp::getGatewayAndSubnetMask(int* gateway, int gsize, int* subnetmask, int ssize)
{
    uint8_t mode;
    char str_mode[10];
    if (!qATCWMODE(&mode, str_mode, sizeof(str_mode))) {
        return false;
    }
    
    if (mode == 1) // STA mode
        return eATCIPSTA(gateway, gsize, subnetmask, ssize);
    else if (mode == 2) // AP mode
        return eATCIPAP(gateway, gsize, subnetmask, ssize);
    return false;
}

bool ESP82664fp::enableMUX(void)
{
    return sATCIPMUX(1);
}

bool ESP82664fp::disableMUX(void)
{
    return sATCIPMUX(0);
}

bool ESP82664fp::createTCP(String addr, uint32_t port)
{
    return sATCIPSTARTSingle("TCP", addr, port);
}

bool ESP82664fp::releaseTCP(void)
{
    return eATCIPCLOSESingle();
}

bool ESP82664fp::registerUDP(String addr, uint32_t port)
{
    return sATCIPSTARTSingle("UDP", addr, port);
}

bool ESP82664fp::unregisterUDP(void)
{
    return eATCIPCLOSESingle();
}

bool ESP82664fp::createTCP(uint8_t mux_id, String addr, uint32_t port)
{
    return sATCIPSTARTMultiple(mux_id, "TCP", addr, port);
}

bool ESP82664fp::releaseTCP(uint8_t mux_id)
{
    return sATCIPCLOSEMulitple(mux_id);
}

bool ESP82664fp::registerUDP(uint8_t mux_id, String addr, uint32_t port)
{
    return sATCIPSTARTMultiple(mux_id, "UDP", addr, port);
}

bool ESP82664fp::unregisterUDP(uint8_t mux_id)
{
    return sATCIPCLOSEMulitple(mux_id);
}

bool ESP82664fp::setTCPServerTimeout(uint32_t timeout)
{
    return sATCIPSTO(timeout);
}

bool ESP82664fp::startTCPServer(uint32_t port)
{
    if (sATCIPSERVER(1, port)) {
        return true;
    }
    return false;
}

bool ESP82664fp::stopTCPServer(void)
{
    sATCIPSERVER(0);
    restart();
    return false;
}

bool ESP82664fp::startServer(uint32_t port)
{
    return startTCPServer(port);
}

bool ESP82664fp::stopServer(void)
{
    return stopTCPServer();
}

bool ESP82664fp::send(const uint8_t *buffer, uint32_t len)
{
    return sATCIPSENDSingle(buffer, len);
}

