roboard/86Duino/hardware/86duino/x86/libraries/FirmataPlus86/utility/ESP82664fp.cpp
bool ESP82664fp::send(uint8_t mux_id, const uint8_t *buffer, uint32_t len)
{
    return sATCIPSENDMultiple(mux_id, buffer, len);
}

bool ESP82664fp::send_nb(uint8_t mux_id, const uint8_t *buffer, uint32_t len)
{
    return sATCIPSENDMultiple_nb(mux_id, buffer, len);
}

uint32_t ESP82664fp::recv(uint8_t *buffer, uint32_t buffer_size, uint32_t timeout)
{
    return recvPkg(buffer, buffer_size, NULL, timeout, NULL);
}

uint32_t ESP82664fp::recv(uint8_t mux_id, uint8_t *buffer, uint32_t buffer_size, uint32_t timeout)
{
    uint8_t id;
    uint32_t ret;
    ret = recvPkg(buffer, buffer_size, NULL, timeout, &id);
    if (ret > 0 && id == mux_id) {
        return ret;
    }
    return 0;
}

uint32_t ESP82664fp::recv(uint8_t *coming_mux_id, uint8_t *buffer, uint32_t buffer_size, uint32_t timeout)
{
    return recvPkg(buffer, buffer_size, NULL, timeout, coming_mux_id);
}

uint32_t ESP82664fp::recv_nb(uint8_t *coming_mux_id, uint8_t *buffer, uint32_t buffer_size)
{
	return recvPkg_nb(buffer, buffer_size, NULL, coming_mux_id);
}

/*----------------------------------------------------------------------------*/
/* +IPD,<id>,<len>:<data> */
/* +IPD,<len>:<data> */

uint32_t ESP82664fp::recvPkg(uint8_t *buffer, uint32_t buffer_size, uint32_t *data_len, uint32_t timeout, uint8_t *coming_mux_id)
{
    String data;
    char a;
    int32_t index_PIPDcomma = -1;
    int32_t index_colon = -1; /* : */
    int32_t index_comma = -1; /* , */
    int32_t len = -1;
    int8_t id = -1;
    bool has_data = false;
    uint32_t ret;
    unsigned long start;
    uint32_t i;
    
    if (buffer == NULL) {
        return 0;
    }
    
    start = millis();
    while (millis() - start < timeout) {
        if(m_puart->available() > 0) {
            a = m_puart->read();
            data += a;
        }
        
        index_PIPDcomma = data.indexOf("+IPD,");
        if (index_PIPDcomma != -1) {
            index_colon = data.indexOf(':', index_PIPDcomma + 5);
            if (index_colon != -1) {
                index_comma = data.indexOf(',', index_PIPDcomma + 5);
                /* +IPD,id,len:data */
                if (index_comma != -1 && index_comma < index_colon) { 
                    id = data.substring(index_PIPDcomma + 5, index_comma).toInt();
                    if (id < 0 || id > 4) {
                        return 0;
                    }
                    len = data.substring(index_comma + 1, index_colon).toInt();
                    if (len <= 0) {
                        return 0;
                    }
                } else { /* +IPD,len:data */
                    len = data.substring(index_PIPDcomma + 5, index_colon).toInt();
                    if (len <= 0) {
                        return 0;
                    }
                }
                has_data = true;
                break;
            }
        }
    }
    
    if (has_data) {
        i = 0;
        ret = len > buffer_size ? buffer_size : len;
        start = millis();
        while (millis() - start < 3000) {
            while(m_puart->available() > 0 && i < ret) {
                a = m_puart->read();
                buffer[i++] = a;
            }
            if (i == ret) {
                rx_empty();
                if (data_len) {
                    *data_len = len;    
                }
                if (index_comma != -1 && coming_mux_id) {
                    *coming_mux_id = id;
                }
                return ret;
            }
        }
    }
    return 0;
}

uint32_t ESP82664fp::recvPkg_nb(uint8_t *buffer, uint32_t buffer_size, uint32_t *data_len, uint8_t *coming_mux_id)
{
    int i, j, slen;
    
    if (buffer == NULL) return 0;
    
    j = slen = 0;
    
    pushData_now();
    
    while (QueueEmpty(q) == false)
    {
        if (rx_parser(nbData, 1024) == true)
        {
            for (i=0; i<s_len; i++, s_len_index++, j++)
                buffer[j] = nbData[s_len_index];

            slen += s_len;
            
            if (coming_mux_id)
                *coming_mux_id = s_id;

            for (i=0; i<1024; i++) nbData[i] = '\0';
        }
    }

    if (slen > 0) return slen;
    return 0;
}

int ESP82664fp::pushData_now()
{
    while(m_puart->available() > 0)
        PushQueue(q, m_puart->read());
    return -1;
}

int ESP82664fp::checkString(char* c, int c_size, int startpoint, char* ch)
{
    int i, j;
    
    if (c == NULL || ch == NULL) return -1;
    
    for (i=startpoint; i<c_size; i++)
    {
        if (ch[0] == c[i])
        {
            for (j=0; ch[j] != '\0' && ((i+j) < c_size); j++)
                if (ch[j] != c[i+j]) break;
            if (ch[j] == '\0') return i; // found, return index
        }
    }
    return -1; // Not found
}

// 0 : available
// 1 : now unavailable, but it will be available if waiting a minute
int ESP82664fp::Sentence(char* ret, int size) {
    int len = 0, i, headi, ncomma = 0, id = 0;
    char head[6] = "+IPD,";
    
    // find the head
    headi = checkString(ret, size, 0, head);
    if (headi == -1) return 1;
        
    for (i=headi+5; i<size && ret[i] != ':'; i++)
        if (ret[i] == ',') ncomma++;
    
    if (i == size) return 1;
    i = headi + 5; // have ':' and index start behind "+IPD"

    // Get len
    if (ncomma == 1)
    {
        /* format : +IPD,<id>,<len>:<data> */
        id = ret[i] - '0'; // get 'id'
        
        // ignore ',' to next char
        for (i+=2; ret[i] != ':'; i++)
            len = len*10 + (ret[i] - '0');
    }
    else if (ncomma == 0)
    {
        /* +IPD,<len>:<data> */
        for (; ret[i] != ':'; i++)
            len = len*10 + (ret[i] - '0');
    }
    
    // Now i at ':' and we can take 'len' to analysis
    i++; // ignore ':'
    
    if ((i+len-1) < size)
    {
        s_id = id;
        s_len_index = i;
        s_len = len;
        return 0;
    }
    
    return 1;
}

int ESP82664fp::read_until(char* ret, int ret_size, char terminator1, char terminator2)
{
	static int i = 0; // need to set i as "static"
    int available = 1;
    
    pushData_now();

    if (QueueEmpty(q) == false)
        ret[i++] = PopQueue(q); // one byte one time
    
    if (i >= ret_size) {i = 0; return 2;}
    
    available = Sentence(ret, i);
    if (available == 0)
        i = 0; // OK and clear ret[]
    else if (available == 1)
        ; // Continue to read, do nothing
    
    return available;
}

bool ESP82664fp::rx_parser(char* ret, int ret_size)
{
    int i, r;
    char* tmp;
    
    r = read_until(ret, ret_size, '\r', '\n');
    if (r == 0)
    {
        if (strstr(ret, ">") != NULL)
            nb_state_s = 3;
        return true;
    }
    else if (r == 1)
    {
        if ((tmp = strstr(ret, "0,CONNECT")) != NULL)
        {
            clientConnected = true;
            for (i=0; i<9; i++) *(tmp+i) = 'A'; // "0,CONNECT" is replayed by dummy char 'A'
        }
        if ((tmp = strstr(ret, "0,CLOSED")) != NULL)
        {
            clientConnected = false;
            for (i=0; i<8; i++) *(tmp+i) = 'A'; // "0,CLOSED" is replayed by dummy char 'A'
        }
        if ((tmp = strstr(ret, "2,CONNECT")) != NULL)
        {
            sATCIPCLOSEMulitple(2);
            for (i=0; i<9; i++) *(tmp+i) = 'A'; // "2,CONNECT" is replayed by dummy char 'A'
        }
    }
    else if (r == 2)
    {
        if (strstr(ret, "SEND OK") != NULL)
        {
            nb_state_s = 0;
            nb_time_s = millis();
        }
        
        // Clear ret[]
        for (i=0; i<ret_size; i++) ret[i] = '\0';
        return false;
    }
    
