roboard/86Duino/hardware/86duino/x86/libraries/FirmataPlus86/utility/ESP82664fp.cpp
    return false;
}

void ESP82664fp::rx_empty(void) 
{
	char a;
    while(m_puart->available() > 0)
    {
		a = m_puart->read();
        PushQueue(q, a);
    }
}

char* ESP82664fp::recvString(char* target, uint32_t timeout)
{
    int i, j = 0, index;
    char c[1024];
    unsigned long tmp = millis();
    
    for (i=0; i<1024; i++) c[i] = '\0';
    
    while(1)
    {
        if ((millis() - tmp) > timeout) break;
        
        for (;m_puart->available(); j++)
        {
            c[j] = m_puart->read();
            PushQueue(q, c[j]);
        }
        
        index = checkString(c, j, 0, target); // -1: not found; >=0: found
        
        if (index >= 0)
            return target;
    }
    return NULL;
}

char* ESP82664fp::recvString(char* target1, char* target2, uint32_t timeout)
{
    int i, j = 0, index;
    char c[1024];
    char* target = NULL;
    unsigned long tmp = millis();
    
    for (i=0; i<1024; i++) c[i] = '\0';
    
    while(1)
    {
        if ((millis() - tmp) > timeout) break;
        
        for (;m_puart->available(); j++)
        {
            c[j] = m_puart->read();
            PushQueue(q, c[j]);
        }
        
        index = checkString(c, j, 0, target1); // -1: not found; >=0: found
        if (index >= 0)
        {
            target = target1;
            break;
        }
        
        index = checkString(c, j, 0, target2); // -1: not found; >=0: found
        if (index >= 0)
        {
            target = target2;
            break;
        }
    }
    return target;
}

char* ESP82664fp::recvString(char* target1, char* target2, char* target3, uint32_t timeout)
{
    int i, j = 0, index;
    char c[1024];
    char* target = NULL;
    unsigned long tmp = millis();
    
    for (i=0; i<1024; i++) c[i] = '\0';
    
    while(1)
    {
        if ((millis() - tmp) > timeout) break;
        
        for (;m_puart->available(); j++)
        {
            c[j] = m_puart->read();
            PushQueue(q, c[j]);
        }
        
        index = checkString(c, j, 0, target1); // -1: not found; >=0: found
        if (index >= 0)
        {
            target = target1;
            break;
        }
        
        index = checkString(c, j, 0, target2); // -1: not found; >=0: found
        if (index >= 0)
        {
            target = target2;
            break;
        }
        
        index = checkString(c, j, 0, target3); // -1: not found; >=0: found
        if (index >= 0)
        {
            target = target3;
            break;
        }
    }
    return target;
}

bool ESP82664fp::recvFind(char* target, uint32_t timeout)
{
    if (recvString(target, timeout) != NULL)
        return true;
    else
        return false;
}

void ESP82664fp::subString(char* c, int32_t index1, int32_t index2, char* data, int datasize) {
    int i, j;
    
    if ((index2 - index1) >= datasize) return;
    
    for (i=0; i<datasize; i++) data[i] = '\0';
    for (i=index1, j=0; i<index2; i++, j++)
        data[j] = c[i];
    
    return;
}

bool ESP82664fp::recvFindAndFilter(char* target, char* begin, char* end, char* data, int size, uint32_t timeout)
{
    int i, j = 0, index, index1, index2, beginSize;
    char c[1024];
    unsigned long tmp = millis();
    int status = 0;
    
    for (i=0; i<1024; i++) c[i] = '\0';
    
    while(1)
    {
        if ((millis() - tmp) > timeout) break;
        
        for (;m_puart->available(); j++)
        {
            c[j] = m_puart->read();
            PushQueue(q, c[j]);
        }
        
        if (status == 0)
        {
            index = checkString(c, j, 0, target); // -1: not found; >=0: found
            if (index >= 0)
                status = 1;
        }
        else if (status == 1)
        {
            index1 = checkString(c, j, 0, begin); // -1: not found; >=0: found
            if (index >= 0)
                status = 2;
        }
        else if (status == 2)
        {
            index2 = checkString(c, j, index1, end); // -1: not found; >=0: found
            if (index >= 0)
                status = 3;
        }
        else if (status == 3)
        {
            for (i=0; begin[i] != '\0'; i++) beginSize++;
            subString(c, index1+beginSize, index2, data, size);
            return true;
        }
    }
    
    return false;
}

bool ESP82664fp::enableEcho(void)
{
    rx_empty();
    m_puart->println("ATE1");
    return recvFind("OK");
}

bool ESP82664fp::disableEcho(void)
{
    rx_empty();
    m_puart->println("ATE0");
    return recvFind("OK");
}

bool ESP82664fp::eAT(void)
{
    rx_empty();
    m_puart->println("AT");
    return recvFind("OK");
}

bool ESP82664fp::eATRST(void) 
{
    rx_empty();
    m_puart->println("AT+RST");
    return recvFind("ready");
}

bool ESP82664fp::eATGMR(char* version, int size)
{
    rx_empty();
    m_puart->println("AT+GMR");
    return recvFindAndFilter("OK", "\r\r\n", "\r\n\r\nOK", version, size); 
}

bool ESP82664fp::qATCWMODE(uint8_t *mode, char* str_mode, int size) 
{
    bool ret;
    if (!mode) {
        return false;
    }
    rx_empty();
    m_puart->println("AT+CWMODE?");
    ret = recvFindAndFilter("OK", "+CWMODE:", "\r\n\r\nOK", str_mode, size); 
    if (ret) {
        *mode = (uint8_t)atoi(str_mode);
        return true;
    } else {
        return false;
    }
}

bool ESP82664fp::sATCWMODE(uint8_t mode)
{
    char* data;
    rx_empty();
    m_puart->print("AT+CWMODE=");
    m_puart->println(mode);
    
    data = recvString("OK", "no change");
    if (data != NULL)
        return true;
    else
        return false;
}

bool ESP82664fp::sATCWJAP(String ssid, String pwd)
{
    char* data;
    rx_empty();
    m_puart->print("AT+CWJAP=\"");
    m_puart->print(ssid);
    m_puart->print("\",\"");
    m_puart->print(pwd);
    m_puart->println("\"");
    
    data = recvString("OK", "FAIL", 10000);
    if (data != NULL && strcmp(data, "OK") == 0)
        return true;
    else
        return false;
}

bool ESP82664fp::eATCWLAP(char* list, int size)
{
    rx_empty();
    m_puart->println("AT+CWLAP");
    return recvFindAndFilter("OK", "\r\r\n", "\r\n\r\nOK", list, size, 10000);
}

bool ESP82664fp::eATCWQAP(void)
{
    rx_empty();
    m_puart->println("AT+CWQAP");
    return recvFind("OK");
}

bool ESP82664fp::sATCWSAP(String ssid, String pwd, uint8_t chl, uint8_t ecn)
{
    char* data;
    rx_empty();
    m_puart->print("AT+CWSAP=\"");
    m_puart->print(ssid);
    m_puart->print("\",\"");
    m_puart->print(pwd);
    m_puart->print("\",");
    m_puart->print(chl);
    m_puart->print(",");
    m_puart->println(ecn);
    
    data = recvString("OK", "ERROR", 5000);
    if (data != NULL && strcmp(data, "OK") == 0)
        return true;
    else
        return false;
}

bool ESP82664fp::eATCWLIF(char* list, int size)
{
    rx_empty();
    m_puart->println("AT+CWLIF");
    return recvFindAndFilter("OK", "\r\r\n", "\r\n\r\nOK", list, size);
}
bool ESP82664fp::eATCIPSTATUS(char* list, int size)
{
    delay(100);
    rx_empty();
    m_puart->println("AT+CIPSTATUS");
    return recvFindAndFilter("OK", "\r\r\n", "\r\n\r\nOK", list, size);
}
bool ESP82664fp::sATCIPSTARTSingle(String type, String addr, uint32_t port)
{
    char* data;
    rx_empty();
    m_puart->print("AT+CIPSTART=\"");
    m_puart->print(type);
    m_puart->print("\",\"");
    m_puart->print(addr);
    m_puart->print("\",");
    m_puart->println(port);
    
    data = recvString("OK", "ERROR", "ALREADY CONNECT", 10000);
    if (data != NULL && (strcmp(data, "OK") == 0 || strcmp(data, "ALREADY CONNECT") == 0))
        return true;
    else
        return false;
}
bool ESP82664fp::sATCIPSTARTMultiple(uint8_t mux_id, String type, String addr, uint32_t port)
{
    char* data;
    rx_empty();
    m_puart->print("AT+CIPSTART=");
    m_puart->print(mux_id);
    m_puart->print(",\"");
    m_puart->print(type);
    m_puart->print("\",\"");
    m_puart->print(addr);
    m_puart->print("\",");
    m_puart->println(port);
    
    data = recvString("OK", "ERROR", "ALREADY CONNECT", 10000);
    if (data != NULL && (strcmp(data, "OK") == 0 || strcmp(data, "ALREADY CONNECT") == 0))
        return true;
    else
        return false;
}
bool ESP82664fp::sATCIPSENDSingle(const uint8_t *buffer, uint32_t len)
{
    rx_empty();
    m_puart->print("AT+CIPSEND=");
    m_puart->println(len);
    if (recvFind(">", 5000)) {
        rx_empty();
        for (uint32_t i = 0; i < len; i++) {
            m_puart->write(buffer[i]);
        }
        return recvFind("SEND OK", 10000);
    }
    return false;
}
bool ESP82664fp::sATCIPSENDMultiple(uint8_t mux_id, const uint8_t *buffer, uint32_t len)
{
    rx_empty(); // rx_parser(nbData, 128);
    m_puart->print("AT+CIPSEND=");
    m_puart->print(mux_id);
    m_puart->print(",");
    m_puart->println(len);
    if (recvFind(">", 500)) {
        rx_empty(); // rx_parser(nbData, 128);
        for (uint32_t i = 0; i < len; i++) {
            m_puart->write(buffer[i]);
        }
        return recvFind("SEND OK", 10000);
    }
    return false;
}
bool ESP82664fp::sATCIPSENDMultiple_nb(uint8_t mux_id, const uint8_t *buffer, uint32_t len)
{
	switch (nb_state_s) {
		case 0:
			if (millis() - nb_time_s >= 15)
				nb_state_s = 1;
			break;
		case 1:
			m_puart->print("AT+CIPSEND=");
			m_puart->print(mux_id);
			m_puart->print(",");
			m_puart->println(len);
			nb_state_s = 2;
		case 2:
			rx_parser(nbData, 1024);
			if (nb_state_s == 3)
				break;
			else
				return false;
		case 3:
			for (uint32_t i = 0; i < len; i++)
				m_puart->write(buffer[i]);
			nb_state_s = 4;
		case 4:
			rx_parser(nbData, 1024);
			if (nb_state_s == 0)
				return true;
			break;
		default:
			break;
	}
    return false;
}
bool ESP82664fp::sATCIPCLOSEMulitple(uint8_t mux_id)
{
    char* data;
    rx_empty();
    m_puart->print("AT+CIPCLOSE=");
    m_puart->println(mux_id);
    
    data = recvString("OK", "link is not", 5000);
    if (data != NULL && (strcmp(data, "OK") == 0 || strcmp(data, "link is not") == 0))
        return true;
    else
        return false;
}
bool ESP82664fp::eATCIPCLOSESingle(void)
{
    rx_empty();
    m_puart->println("AT+CIPCLOSE");
    return recvFind("OK", 5000);
}
bool ESP82664fp::eATCIFSR(int* list, int size)
{
    char ip[64];
    bool result;
    uint8_t mode;
    char str_mode[10];
    if (!qATCWMODE(&mode, str_mode, sizeof(str_mode))) {
        return false;
    }
    
