roboard/86Duino/hardware/86duino/x86/libraries/FirmataPlus86/utility/ESP82664fp.cpp
    rx_empty();
    m_puart->println("AT+CIFSR");
    if (mode == 1) // STA mode
        result = recvFindAndFilter("OK", "+CIFSR:STAIP,\"", "\"\r\n", ip, 64);
    else if (mode = 2) // AP mode
        result = recvFindAndFilter("OK", "+CIFSR:APIP,\"", "\"\r\n", ip, 64);
    
    if (result == true)
    {
        for (int i=0; i<size; i++) list[i] = 0;
        digitalLocalIP(ip, list);
    }
    return result;
}
bool ESP82664fp::eATCIPSTA(int* gateway, int gsize, int* subnetmask, int ssize)
{
    char ip[64];
    bool result;
    rx_empty();
    m_puart->println("AT+CIPSTA?");
    
    result = recvFindAndFilter("OK", "+CIPSTA:gateway:\"", "\"\r\n", ip, 64);
    if (result == true)
    {
        for (int i=0; i<gsize; i++) gateway[i] = 0;
        digitalLocalIP(ip, gateway);
    }
    else
        return result;
    
    timer_Delay(100);
    rx_empty();
    m_puart->println("AT+CIPSTA?");
    result = recvFindAndFilter("OK", "+CIPSTA:netmask:\"", "\"\r\n", ip, 64);
    if (result == true)
    {
        for (int i=0; i<ssize; i++) subnetmask[i] = 0;
        digitalLocalIP(ip, subnetmask);
    }
    else
        return result;
    
    return result;
}
bool ESP82664fp::eATCIPAP(int* gateway, int gsize, int* subnetmask, int ssize)
{
    char ip[64];
    bool result;
    rx_empty();
    m_puart->println("AT+CIPAP?");
    
    result = recvFindAndFilter("OK", "+CIPAP:gateway:\"", "\"\r\n", ip, 64);
    if (result == true)
    {
        for (int i=0; i<gsize; i++) gateway[i] = 0;
        digitalLocalIP(ip, gateway);
    }
    else
        return result;
    
    timer_Delay(100);
    rx_empty();
    m_puart->println("AT+CIPAP?");
    result = recvFindAndFilter("OK", "+CIPAP:netmask:\"", "\"\r\n", ip, 64);
    if (result == true)
    {
        for (int i=0; i<ssize; i++) subnetmask[i] = 0;
        digitalLocalIP(ip, subnetmask);
    }
    else
        return result;
    
    return result;
}
void ESP82664fp::digitalLocalIP(char* ip, int* list)
{
    int i;
    for (i=0; ip[i] != '.'; i++)
        list[0] = list[0]*10 + (ip[i] - '0');
    for (i++; ip[i] != '.'; i++)
        list[1] = list[1]*10 + (ip[i] - '0');
    for (i++; ip[i] != '.'; i++)
        list[2] = list[2]*10 + (ip[i] - '0');
    for (i++; ip[i] != '\0'; i++)
        list[3] = list[3]*10 + (ip[i] - '0');
}
bool ESP82664fp::sATCIPMUX(uint8_t mode)
{
    char* data;
    rx_empty();
    m_puart->print("AT+CIPMUX=");
    m_puart->println(mode);
    
    data = recvString("OK", "Link is builded");
    if (data != NULL && strcmp(data, "OK") == 0)
        return true;
    else
        return false;
}
bool ESP82664fp::sATCIPSERVER(uint8_t mode, uint32_t port)
{
    char* data;
    if (mode) {
        rx_empty();
        m_puart->print("AT+CIPSERVER=1,");
        m_puart->println(port);
        
        data = recvString("OK", "no change");
        if (data != NULL && (strcmp(data, "OK") == 0 || strcmp(data, "no change") == 0))
            return true;
        else
            return false;
    } else {
        rx_empty();
        m_puart->println("AT+CIPSERVER=0");
        return recvFind("\r\r\n");
    }
}
bool ESP82664fp::sATCIPSTO(uint32_t timeout)
{
    rx_empty();
    m_puart->print("AT+CIPSTO=");
    m_puart->println(timeout);
    return recvFind("OK");
}

